##### AIM:
To perform operations on Pandas DataFrame.

In [1]:
import pandas as pd
import numpy as np

In [5]:
# Create a dictionary with keys,values as list
dictionary = {'RollNo.': [501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512],
 'Name': ['Ram.N.K', 'Kumar.A', 'Kavi.S', 'Malar.M', 'Seetha.P.', 'Kishore.L', 'Amit.M ',
'Daniel.R', 'Shyam.M.', 'Priya.N', 'Mani.R.', 'Ravi.S'],
 'Attend8': [92, 100, 100, 100, 76, 96, 100, 92, 68, 52, 72, 80],
 'Attend9' : [84, 95, 90, 100, 42, 84, 95, 100, 53, 16, 53, np.nan],
 'Attend10': [100, 100, 94, 100, 31, 81, 100, 100, 94, 13, 88, 6],
 'Assignment' : [15, 13, 14, 14, 13, 14, 14, 14, 5, np.nan, np.nan, np.nan],
 'Test' : [19, 14, 19, 18, 17, 19, 19, 19, 18, '-', 18, '-' ]
 }

##### convert dictionary to pandas dataframe

In [6]:
df = pd.DataFrame(dictionary)
print(df)

    RollNo.       Name  Attend8  Attend9  Attend10  Assignment Test
0       501    Ram.N.K       92     84.0       100        15.0   19
1       502    Kumar.A      100     95.0       100        13.0   14
2       503     Kavi.S      100     90.0        94        14.0   19
3       504    Malar.M      100    100.0       100        14.0   18
4       505  Seetha.P.       76     42.0        31        13.0   17
5       506  Kishore.L       96     84.0        81        14.0   19
6       507    Amit.M       100     95.0       100        14.0   19
7       508   Daniel.R       92    100.0       100        14.0   19
8       509   Shyam.M.       68     53.0        94         5.0   18
9       510    Priya.N       52     16.0        13         NaN    -
10      511    Mani.R.       72     53.0        88         NaN   18
11      512     Ravi.S       80      NaN         6         NaN    -

###### Check for missing values

In [11]:
print('Count of missing values: \n' , df.isnull().sum())

Count of missing values:
 RollNo.       0
Name          0
Attend8       0
Attend9       0
Attend10      0
Assignment    3
Test          0
dtype: int64

##### Fill missing values in Attend9 with 0

In [8]:
df['Attend9'] = df['Attend9'].fillna(0)
print(df['Attend9'])

0      84.0
1      95.0
2      90.0
3     100.0
4      42.0
5      84.0
6      95.0
7     100.0
8      53.0
9      16.0
10     53.0
11      0.0
Name: Attend9, dtype: float64

######  Fill missing values with minimum value in Assignment and Replace by 0 in Test

In [12]:
df['Assignment'] = df['Assignment'].fillna(df['Assignment'].min())
df = df.replace(['-'], 0)
print(df)

    RollNo.       Name  Attend8  Attend9  Attend10  Assignment  Test
0       501    Ram.N.K       92     84.0       100        15.0    19
1       502    Kumar.A      100     95.0       100        13.0    14
2       503     Kavi.S      100     90.0        94        14.0    19
3       504    Malar.M      100    100.0       100        14.0    18
4       505  Seetha.P.       76     42.0        31        13.0    17
5       506  Kishore.L       96     84.0        81        14.0    19
6       507    Amit.M       100     95.0       100        14.0    19
7       508   Daniel.R       92    100.0       100        14.0    19
8       509   Shyam.M.       68     53.0        94         5.0    18
9       510    Priya.N       52     16.0        13         5.0     0
10      511    Mani.R.       72     53.0        88         5.0    18
11      512     Ravi.S       80      0.0         6         5.0     0

###### Select rows based on conditions >=80, <80 and >=70, <70 for August Attendance

In [9]:
result80above_df = df[(df['Attend8']>=80)]
result70to80_df = df[(df['Attend8']<80) & (df['Attend8']>=70)]
result70below_df = df.loc[df['Attend8']<70]
print('Attendance above 80 \n', result80above_df)
print('Attendance between 70 and 80 \n', result70to80_df)
print('Attendance below 70 \n', result70below_df)

Attendance above 80
     RollNo.       Name  Attend8  Attend9  Attend10  Assignment Test
0       501    Ram.N.K       92     84.0       100        15.0   19
1       502    Kumar.A      100     95.0       100        13.0   14
2       503     Kavi.S      100     90.0        94        14.0   19
3       504    Malar.M      100    100.0       100        14.0   18
5       506  Kishore.L       96     84.0        81        14.0   19
6       507    Amit.M       100     95.0       100        14.0   19
7       508   Daniel.R       92    100.0       100        14.0   19
11      512     Ravi.S       80      0.0         6         NaN    -
Attendance between 70 and 80
     RollNo.       Name  Attend8  Attend9  Attend10  Assignment Test
4       505  Seetha.P.       76     42.0        31        13.0   17
10      511    Mani.R.       72     53.0        88         NaN   18
Attendance below 70
    RollNo.      Name  Attend8  Attend9  Attend10  Assignment Test
8      509  Shyam.M.       68     53.0        94         5.0   18
9      510   Priya.N       52     16.0        13         NaN    -

###### Arrange and display students in decreasing order of September attendance

In [10]:
Attend9sorted_df = df.sort_values(by='Attend9', ascending=False)
print('Sorted September Attendance \n')
display(Attend9sorted_df.loc[:,['RollNo.','Name','Attend9']])

Sorted September Attendance

    RollNo.       Name  Attend9
3       504    Malar.M    100.0
7       508   Daniel.R    100.0
1       502    Kumar.A     95.0
6       507    Amit.M      95.0
2       503     Kavi.S     90.0
0       501    Ram.N.K     84.0
5       506  Kishore.L     84.0
8       509   Shyam.M.     53.0
10      511    Mani.R.     53.0
4       505  Seetha.P.     42.0
9       510    Priya.N     16.0
11      512     Ravi.S      0.0

#####  Find students with 100% attendance for all three months together and include/display consolidated attendance as last column

In [13]:
sum_df = df['Attend8'] + df['Attend9'] + df['Attend10']
finalattend_df = sum_df/3
df['Consolidated Attendance'] = finalattend_df
print('Consolidated Attendance = \n', df)

Consolidated Attendance =
     RollNo.       Name  Attend8  Attend9  Attend10  Assignment  Test  \
0       501    Ram.N.K       92     84.0       100        15.0    19
1       502    Kumar.A      100     95.0       100        13.0    14
2       503     Kavi.S      100     90.0        94        14.0    19
3       504    Malar.M      100    100.0       100        14.0    18
4       505  Seetha.P.       76     42.0        31        13.0    17
5       506  Kishore.L       96     84.0        81        14.0    19
6       507    Amit.M       100     95.0       100        14.0    19
7       508   Daniel.R       92    100.0       100        14.0    19
8       509   Shyam.M.       68     53.0        94         5.0    18
9       510    Priya.N       52     16.0        13         5.0     0
10      511    Mani.R.       72     53.0        88         5.0    18
11      512     Ravi.S       80      0.0         6         5.0     0

    Consolidated Attendance
0                 92.000000
1                 98.333333
2                 94.666667
3                100.000000
4                 49.666667
5                 87.000000
6                 98.333333
7                 97.333333
8                 71.666667
9                 27.000000
10                71.000000
11                28.666667

##### Display the details of students who scored maximum marks in test

In [15]:
Test_max = df['Test'].max()
Assign_max = df['Assignment'].max()
print('Details of students who scored maximum marks in Test = \n')
display(df.loc[df['Test']==df['Test'].max()])

Details of students who scored maximum marks in Test =

,RollNo.,Name,Attend8,Attend9,Attend10,Assignment,Test,Consolidated Attendance
0,501,Ram.N.K,92,84.0,100,15.0,19,92.000000
2,503,Kavi.S,100,90.0,94,14.0,19,94.666667
5,506,Kishore.L,96,84.0,81,14.0,19,87.000000
6,507,Amit.M,100,95.0,100,14.0,19,98.333333
7,508,Daniel.R,92,100.0,100,14.0,19,97.333333

###### Display details of students whose Assignment marks is < than average of Assignment marks

In [17]:
Assign_mean = df['Assignment'].mean()
print('Details of students whose Assignment marks is less than Average of Assignment marks:\n')
display(df[(df['Assignment']< Assign_mean)])

Details of students whose Assignment marks is less than Average of Assignment marks:

,RollNo.,Name,Attend8,Attend9,Attend10,Assignment,Test,Consolidated Attendance
8,509,Shyam.M.,68,53.0,94,5.0,18,71.666667
9,510,Priya.N,52,16.0,13,5.0,0,27.000000
10,511,Mani.R.,72,53.0,88,5.0,18,71.000000
11,512,Ravi.S,80,0.0,6,5.0,0,28.666667

###### Display Result='Pass' if the student has scored > than 20 in assignment+test put together

In [18]:
df['Result'] = df['Assignment']+ df['Test']
df['Result'] = df['Result'].apply(lambda x: 'Pass' if x >= 20 else 'Fail')
display(df)

,RollNo.,Name,Attend8,Attend9,Attend10,Assignment,Test,Consolidated Attendance,Result
0,501,Ram.N.K,92,84.0,100,15.0,19,92.000000,Pass
1,502,Kumar.A,100,95.0,100,13.0,14,98.333333,Pass
2,503,Kavi.S,100,90.0,94,14.0,19,94.666667,Pass
3,504,Malar.M,100,100.0,100,14.0,18,100.000000,Pass
4,505,Seetha.P.,76,42.0,31,13.0,17,49.666667,Pass
5,506,Kishore.L,96,84.0,81,14.0,19,87.000000,Pass
6,507,Amit.M,100,95.0,100,14.0,19,98.333333,Pass
7,508,Daniel.R,92,100.0,100,14.0,19,97.333333,Pass
8,509,Shyam.M.,68,53.0,94,5.0,18,71.666667,Pass
9,510,Priya.N,52,16.0,13,5.0,0,27.000000,Fail
10,511,Mani.R.,72,53.0,88,5.0,18,71.000000,Pass
11,512,Ravi.S,80,0.0,6,5.0,0,28.666667,Fail